abhaengigkeiten
abnahmekriterien
abort
absolute
accept
accepts
access
accessibility
accumulate
action
actions
active
actor
actors
adapter
adaptierbar
add
addendum
addon
addr
admin
adoption
after
against
agent
agents
aggregate
aktivierung
aktuellen
aktueller
aliases
all
allow
allowed
allows
alternation
analyze
anchor
and
anderen
anforderungen
anforderungsbereichen
anforderungsliste
anforderungsnah
annotated
anonymous
ansicht
answer
anthropic
any
anzeigen
api
apis
app
append
appends
applied
applies
apply
approval
approvals
approve
approved
apps
arbeitsfaehigkeit
arbeitskontext
arc
architecture
architektur
architekturentscheidungen
archive
archives
are
arg
args
argument
arguments
array
artefakt
artefakte
artefakttransparenz
artifact
artifacts
ask
askuser
assert
asset
assets
assign
assignment
assistant
attach
attachment
attachments
audit
auf
aufwand
augment
ausbau
ausfuehrung
ausgangspunkt
auth
authenticode
authority
authorization
authorize
auto
automatic
autonomous
autoprefixer
available
awaiting
axe
back
backend
backends
background
backlog
backup
backups
backward
bare
barrier
barriers
base
baseline
bash
basis
batches
bearing
bedienung
before
begin
behavior
bei
beispiel
bekannte
benachrichtigungen
benefits
ber
bereits
besser
bestehender
beta
betrieb
betriebsgrenzen
betroffene
bewertungsbasis
bezug
bin
binary
bind
binding
bindings
binds
bing
bins
blob
block
blocked
blocks
bloecken
body
bool
boolean
boot
bootstrap
bound
boundaries
boundary
bounded
bounds
box
bridge
bridged
bridges
browser
budget
budgets
buf
buffers
build
builder
builds
builtin
bun
bundle
bundled
busy
but
button
buttons
byte
bytes
cache
calculate
call
callback
callbacks
calls
camel
can
cancel
canceled
candidate
candidates
cannot
canonical
canonicalize
cap
capabilities
capability
capacity
capture
captured
captures
card
cards
cargo
cascade
cascades
case
cases
catalog
categories
category
cell
certificate
chain
change
changes
characters
chars
chat
chats
check
checklist
checkpoint
checkpoints
checks
checksums
chevron
child
choice
choose
chrome
chunk
claim
clamp
clarification
clarifying
class
classes
classify
claude
clean
clear
cli
click
client
clip
clone
close
closed
closes
clsx
cmd
code
coding
collapse
collapsed
collect
collection
color
colors
column
come
command
commands
comment
commit
compact
compaction
compare
compatibility
compatible
compiler
complete
completed
completes
completion
complex
compliance
component
components
compute
computer
concise
conclusion
concurrency
concurrently
conf
confidence
config
configs
configuration
configure
configured
confirm
confirmation
conflict
connection
connector
connectors
consistency
construction
constructor
contain
container
contains
content
contention
contents
context
continuation
continues
contract
contributing
contribution
control
controls
conversation
conversion
convert
coordinate
coordinator
copilot
copy
core
corrupt
cost
count
counts
cover
covers
cowork
crash
create
created
creates
creating
credential
credentials
crew
crewai
crews
criteria
cross
csp
css
csv
curated
current
custom
cwd
cycle
daily
dangerous
darstellung
data
database
date
dateien
dateisicherheit
dateisystem
daten
datenfundament
datenschutz
debug
debugging
decision
decisions
decode
dedupe
deduplication
deep
def
default
defaults
definition
definitions
defs
degraded
deiner
delay
delegate
delete
deleted
deleting
deletion
delimited
delivered
delta
den
denial
denied
density
deny
dependencies
dependency
dependent
deprecation
deprecations
depth
der
derive
desc
descendant
descendants
describe
description
descriptor
deserialize
deserializes
design
designsystem
desktop
desktopscreenshot
destinations
destroy
destructive
detach
detail
details
detect
detected
detection
detects
deterministic
dev
development
diagnose
diagnostic
diagnostics
dialog
dichte
die
dieser
diff
differences
different
diffs
dir
directories
directory
direkt
dirs
disabled
disables
disallowed
discipline
disclaimer
dispatch
display
displayed
dist
dive
dll
doc
dock
docker
docs
doctor
document
documentation
documents
docx
does
dokumentation
dom
domaenen
domain
done
down
downgrades
download
draft
drag
dragged
drain
drive
drop
duck
duckduckgo
due
duplicate
durability
duration
durchklickrunde
echo
edit
editor
edits
effective
effects
eingeklappten
einschr
einstellungen
einstellungsarchitektur
einstieg
einzelne
eku
element
elements
ellipsis
embedded
emit
empfohlene
empty
enable
enabled
encode
end
endpoint
endpunkte
endtag
enforce
enforces
engine
engineering
english
enqueue
ensure
enter
enterprise
entfernen
entfernung
entities
entries
entry
entscheidung
entwicklung
env
envelope
envelopes
environment
epoch
equal
erasable
erfolg
erledigt
erreichbar
error
errors
erster
erweiterungsplattform
erzeugt
escape
eslint
estimate
evaluate
even
event
events
evidence
exact
example
examples
excel
exception
exceptions
excerpt
exclusive
exe
exec
executable
execute
executes
execution
exist
existing
exists
exit
exp
expand
expanded
expected
experience
explicit
export
exporte
exports
expose
exposes
exposing
expression
extension
extensions
external
extract
extractor
extracts
extrahierte
fail
failed
failing
fails
failure
fake
fall
fallback
falls
fallthrough
familien
family
feature
features
fehlende
fehlerbilder
fehlerprotokoll
fehlerzustaende
fensterverhalten
fensterzustand
fetch
field
fields
file
files
filesystem
filter
filters
final
find
findings
finds
first
fit
fix
fixed
fixture
fixtures
flag
flags
flow
flush
fmt
focus
fokusmanagement
folder
folders
folgeaktionen
follow
followable
for
forbidden
force
foreign
form
format
formats
formatter
fortgeschritten
fortschritt
found
foundation
fragments
free
freeze
fresh
freshness
from
frontend
frontmatter
frozen
fuer
full
fulltext
function
fundament
funktionalit
funktionstest
gate
gates
gateway
gateways
gemma
gen
generate
generated
generating
generation
german
gestaltungsprinzipien
get
glob
global
globale
globalen
globals
goal
goals
governance
governed
graphify
grep
group
guarantees
guard
guards
guess
guided
guidelines
gzip
handle
handler
handshake
hardening
has
hash
hauptansicht
hauptarbeitsflaeche
hauptnavigation
have
header
headers
health
help
helper
hermes
hex
hidden
hide
high
highlighted
highlights
hinaus
hint
hints
hinweis
hinweise
hinzuf
history
hits
hoher
home
hooks
host
hosts
hourly
how
hpc
href
html
http
https
humanize
hydrate
icon
icons
idempotency
idempotent
identifier
identifiers
identifizieren
ids
ignorable
ignore
ignored
image
images
implementation
implemented
implementieren
implementierungsvergleich
import
important
imported
importing
improve
improvement
include
increment
independent
index
individual
infer
inference
inferred
info
informationsarchitektur
infos
inheriting
init
initial
initialfassung
initialization
initialize
initialized
injection
inline
input
insert
inside
insights
install
installer
instance
instances
instatce
instead
instruction
instructions
int
integration
integriert
integrity
intelligence
intentional
intentionally
interaktion
internal
internationalization
interpret
interrupt
interval
into
invalid
inventory
invisible
invocation
invoke
ipv
ipynb
iso
isolated
isolation
ist
item
items
iterator
its
jedes
jest
jetzt
jsdom
json
jsonl
jsx
junction
kandidaten
kapitel
katalog
keep
keeping
keeps
keine
key
keypress
keys
keyword
keywords
kill
killer
kind
klarer
knowledge
known
komponenten
konfiguration
konfigurationsklarheit
konfigurationsquellen
konkrete
konsistenz
kontext
kontextzone
kontrast
kontrollierbarkeit
kurzfazit
label
labels
lade
language
languages
largest
last
late
latest
launch
layer
layout
leak
learning
learnings
leer
left
legacy
legacyscreenshot
length
lesbarkeit
level
levels
lib
library
license
licenses
lifecycle
like
likely
limit
limited
limiting
line
lines
link
linke
linked
links
lint
list
listen
lite
litellm
live
llm
load
loaded
loader
loading
local
locale
localhost
locals
location
locator
locked
log
logging
logical
logik
logs
lokal
lokale
lokaler
long
looks
lookup
loopback
loose
lossy
low
lower
lucide
mac
made
main
maintenance
make
malformed
managed
management
manager
manifested
map
mapping
maps
mark
markdown
marker
master
match
matches
matching
matifest
matrix
max
mcp
mcpscreenshot
meanings
meilensteine
memory
merge
message
messages
meta
metadata
method
metric
migrate
migrated
migration
migrationen
mikrotexte
million
minimalfreigabe
missing
mission
mistaken
mittlerer
mixed
mjs
mobile
mock
mode
model
modell
modellverwaltung
models
modes
modification
modified
module
monitor
monitoring
monotonic
more
mouse
move
msvc
multi
multiple
muss
must
mutate
mutation
mutations
mutex
nach
nachrichtenverlauf
nachziehen
naechste
naechsten
nah
name
named
namensfalle
names
narrated
native
natural
navigate
navigation
needed
needs
nested
network
neue
never
new
newer
news
next
nicht
nken
noch
node
noise
non
noncanonical
noop
normal
normalize
normalized
not
note
notebook
notes
notices
notification
notifications
now
npm
nullable
number
numbered
numeric
nutzen
nutzer
object
objects
observability
oder
oekosystem
offen
offenlegung
office
offline
old
ollama
omits
omitted
onboarding
once
one
only
opaque
open
openai
openclaw
opener
openrouter
operational
operations
operator
option
optional
options
orchestrator
orchestrierung
order
ordered
organize
orientierung
origin
origins
out
outcome
outcomes
output
outputs
outside
overlap
overlay
overloaded
overrides
oversized
overwritten
owned
owner
ownership
package
packaging
page
pages
pair
paired
pairs
palette
pane
panel
panels
parallel
parameters
params
parent
paritaet
parse
parsed
parser
parses
part
partial
parts
patch
path
paths
pattern
patterns
payload
payloads
pdf
pdfium
pending
per
performance
permission
permissions
permits
persist
persisted
persistence
persistent
persistenz
persists
person
personalisierung
personalities
personality
personenwochen
pfad
pflichtszenarien
phase
phrase
phrases
pick
pinned
pipeline
pipelines
placeholders
plaintext
plan
planansicht
plane
planning
platform
plattform
playwright
plugin
plugins
plus
point
pointer
policies
policy
ports
positioning
positive
posix
post
postcss
power
powerpoint
powershell
ppt
pptx
pragmas
pre
precedence
preferences
prefix
prefixed
prefixes
prelude
prepare
prepared
prerequisites
present
presentation
preserves
preset
presets
prevents
preview
previous
primary
primitives
print
priorisiert
priorisierung
privacy
private
pro
probe
problem
process
processes
product
production
productivity
produkt
produktionshinweise
produktionsniveau
produktivitaetsfeatures
produktmessung
produktwert
profile
profiles
progress
progressive
project
projects
projekt
projekte
projekteinstellungen
prompt
prompteingabe
prompts
prop
properties
property
props
protected
protocol
provenance
provider
providers
prune
pty
public
pull
purl
purpose
push
python
pythonhome
qualit
quality
quellen
queries
querschnittliche
query
question
queue
queued
queues
quick
quote
quoted
quotes
rail
raise
random
ranks
rate
raw
reachability
reachable
react
read
readable
reader
readme
reads
ready
real
reason
reasoning
recall
receiver
recherche
rechte
recommended
reconcile
reconciles
record
recording
records
recover
recovered
recovery
recursive
recursively
redact
redacted
redaction
redacts
redirect
ref
refactor
reference
referenced
references
refresh
refs
reg
regex
region
regions
register
registered
registry
regular
reject
rejected
rejects
relative
release
relevante
remains
remote
remove
removes
rename
render
rendern
reopen
reordered
repair
replace
replacement
replay
replayable
report
reported
reports
repository
represents
request
requests
require
required
requirement
requirements
requires
requiring
research
reset
resize
resolution
resolvable
resolve
resolved
resource
resources
respect
respects
response
responsives
restart
restore
restores
result
results
resume
retained
retention
retries
retrieval
retry
retryable
returned
returns
revalidates
review
revision
rewrites
right
risk
risky
robustheitsprinzipien
role
roles
rolling
rolls
root
roots
rot
rotate
rotation
round
route
router
routes
routing
row
rows
rpc
rpm
rueckmeldung
ruhe
rule
rules
run
runbook
runner
running
runs
runtime
rust
safe
safely
safety
same
sample
sandbox
sandboxes
sanitize
sanitized
sanitizes
save
sbom
scalar
sch
schedule
scheduled
scheduler
scheduling
schema
schemas
schritt
scope
scoped
score
screen
screenreader
screenshot
screenshots
script
scripts
scroll
search
second
secret
secrets
section
sections
secure
security
seed
seeds
select
selected
selection
selector
selectors
self
semantik
send
sensitive
sentinels
separate
sequence
serialize
serialized
serializes
server
serverless
servers
service
session
sessions
set
setting
settings
setup
severity
sha
shape
share
shared
shell
short
shortcut
shortcuts
shot
should
show
shutdown
sibling
sichere
sicherheits
side
sidebar
sidecar
sign
signal
signature
signed
signing
simple
single
sink
sinks
size
skalierung
skill
skills
skip
slash
sleep
slice
slides
slugify
smoke
smoothed
snake
snapshot
snapshots
snippet
snippets
socket
soll
solution
source
sources
space
spawn
spawning
spec
split
splitting
sprache
sql
sqlite
src
ssh
stabilitaet
stable
stably
stack
stand
start
starter
startprobleme
starttag
startup
state
statement
states
static
stats
status
statuses
statuskonsistenz
stays
stdin
stdout
stellen
stem
stems
step
steps
steuerung
stop
stopped
storage
store
stored
stores
story
str
strategischer
stream
streaming
streams
strict
string
stringify
strings
strip
structure
structured
style
styling
sub
subject
subprocess
subsequent
substring
subsystem
subsystems
success
suche
suffix
suggestion
suggestions
summarize
summarized
summary
superseded
supply
support
supported
supports
suppress
surface
surfaces
survives
svg
switch
switcher
sync
syncable
synchronize
synchronous
syntax
system
tab
table
tables
tabs
tag
tage
tags
tail
tailwind
tailwindcss
tampered
tanstack
target
targets
task
tasks
tastaturbedienung
tauri
tear
technical
technische
template
templates
tenant
terminal
terminate
terminates
terms
test
testen
testing
tests
teststrategie
testtiefe
text
textarea
textliche
textual
than
the
theme
themengebiete
think
thinking
this
thread
threads
threat
thumbprint
tick
time
timeout
timeouts
timestamp
timezone
title
tls
today
todo
toggle
token
tokenize
tokens
tombstone
tone
too
tool
toolbar
toolchain
tools
toolset
topological
topologically
total
totals
touch
trace
transfer
transform
transitional
translation
tratsport
traversal
tray
tree
trigger
triggers
trim
trip
trips
true
truncate
truncated
truncation
trust
truth
try
tsconfig
tskriterien
tsx
turn
two
txt
typ
type
typecheck
types
typescript
ueber
uebernahme
uebersicht
uid
umsetzung
umsetzungsreihenfolge
umsetzungsschritte
unauthenticated
unavailable
unchanged
unclean
und
unique
unmittelbar
unrouted
unsafe
unsigned
unsupported
unused
unwrap
update
updates
upgrade
upgraded
upsert
uri
url
urls
usage
use
used
useful
user
uses
utc
utf
utils
uuid
valid
validate
validation
validieren
value
values
variance
variant
vars
vault
vec
venv
verbatim
verbose
vergleich
verification
verified
verifizierter
verify
version
versions
versus
vertraege
via
view
viewer
viewports
views
violations
visible
vision
visuelle
vite
vitejs
vitest
void
volatile
vollstaendige
von
voraussetzungen
vorbereitung
vorhanden
vorher
vorlaeufig
vulnerability
wait
waiter
waits
wal
walk
wann
warning
warnings
was
watch
watcher
web
websearch
webview
weekday
welchen
welcome
wheels
when
while
whitelist
whitelisted
whitespace
why
width
wildcard
window
windows
with
without
word
words
work
workbench
worker
workflow
working
works
workspace
workspaces
wrapping
writable
write
writing
wsl
xlsx
xml
xterm
yaml
you
zeit
ziel
zielbild
ziele
zip
zod
zoom
zusammenklapp
zustand
zweck